<a href="https://colab.research.google.com/github/bwilli2086/data_analytics/blob/main/Python/Data_Wrangling.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [37]:
import pandas as pd
import numpy as np
book_df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/BL-Flickr-Images-Book.csv')
book_df.shape
book_df.head(10)

   Identifier  ...                              Shelfmarks
0         206  ...       British Library HMNTS 12641.b.30.
1         216  ...       British Library HMNTS 12626.cc.2.
2         218  ...       British Library HMNTS 12625.dd.1.
3         472  ...     British Library HMNTS 10369.bbb.15.
4         480  ...        British Library HMNTS 9007.d.28.
5         481  ...       British Library HMNTS 9006.ee.10.
6         519  ...        British Library HMNTS 12637.e.3.
7         667  ...      British Library HMNTS 011652.g.73.
8         874  ...      British Library HMNTS 11645.bb.42.
9        1143  ...  British Library HMNTS 11602.ee.10.(2.)

[10 rows x 15 columns]

In [38]:
book_df.columns

Index(['Identifier', 'Edition Statement', 'Place of Publication',
       'Date of Publication', 'Publisher', 'Title', 'Author', 'Contributors',
       'Corporate Author', 'Corporate Contributors', 'Former owner',
       'Engraver', 'Issuance type', 'Flickr URL', 'Shelfmarks'],
      dtype='object')

In [39]:
columns_to_be_drop=['Edition Statement','Corporate Author','Corporate Contributors','Former owner','Engraver']
type(columns_to_be_drop)

list

In [40]:
new_book_df=book_df.drop(columns_to_be_drop,axis=1)
new_book_df.head()

   Identifier  ...                           Shelfmarks
0         206  ...    British Library HMNTS 12641.b.30.
1         216  ...    British Library HMNTS 12626.cc.2.
2         218  ...    British Library HMNTS 12625.dd.1.
3         472  ...  British Library HMNTS 10369.bbb.15.
4         480  ...     British Library HMNTS 9007.d.28.

[5 rows x 10 columns]

In [41]:
new_book_df['Identifier'].is_unique
book_reindexed_df=new_book_df['Identifier']
#book_reindex_df.head()

In [42]:
new_book_df['Author'].value_counts()

Shakespeare, William                        48
Byron, George Gordon Byron - Baron          40
Scott, Walter - Sir                         29
Burns, Robert                               28
NORIE, John William.                        26
                                            ..
BUNGE, Friedrich Georg von.                  1
ECKARDT, Julius Wilhelm Albert von.          1
MACURE, John - called John Campbell          1
BORGNET, Jules - and BORMANS (Stanislas)     1
LEFROY, William Chambers.                    1
Name: Author, Length: 5005, dtype: int64

In [43]:
new_book_df['Date of Publication'].value_counts()

1897        157
1896        150
1893        130
1892        127
1898        125
           ...
1898?]        1
[1842]        1
1510?]        1
1873, 93      1
1876-87]      1
Name: Date of Publication, Length: 1148, dtype: int64

In [ ]:
book_reindexed_df['Date of publication'].str.isnumeric()

In [44]:
new_book_df.iloc[206]

Identifier                                                          77554
Place of Publication                                               London
Date of Publication                                                  1848
Publisher                                                 Richard Bentley
Title                   Rambles in the romantic regions of the Hartz M...
Author                                   Andersen, H. C. (Hans Christian)
Contributors                                  BECKWITH-LOHMEYER, Charles.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 10250.c.16.
Name: 206, dtype: object

In [45]:
new_book_df.loc[206]

Identifier                                                          77554
Place of Publication                                               London
Date of Publication                                                  1848
Publisher                                                 Richard Bentley
Title                   Rambles in the romantic regions of the Hartz M...
Author                                   Andersen, H. C. (Hans Christian)
Contributors                                  BECKWITH-LOHMEYER, Charles.
Issuance type                                                 monographic
Flickr URL              http://www.flickr.com/photos/britishlibrary/ta...
Shelfmarks                              British Library HMNTS 10250.c.16.
Name: 206, dtype: object

In [ ]:
#new_book_df['Date of Publication']= book_reindexed_df['Date of Publication'].str.extract(regex_val, expand=False)

In [46]:
regex_val=r'^(\d{4})'
new_book_df['Date of Publication'] =new_book_df['Date of Publication'].str.extract(regex_val, expand=False)
new_book_df['Date of Publication']

0       1879
1       1868
2       1869
3       1851
4       1857
        ...
8282    1838
8283    1831
8284     NaN
8285    1834
8286    1834
Name: Date of Publication, Length: 8287, dtype: object

In [47]:
new_book_df.head(10)

   Identifier  ...                              Shelfmarks
0         206  ...       British Library HMNTS 12641.b.30.
1         216  ...       British Library HMNTS 12626.cc.2.
2         218  ...       British Library HMNTS 12625.dd.1.
3         472  ...     British Library HMNTS 10369.bbb.15.
4         480  ...        British Library HMNTS 9007.d.28.
5         481  ...       British Library HMNTS 9006.ee.10.
6         519  ...        British Library HMNTS 12637.e.3.
7         667  ...      British Library HMNTS 011652.g.73.
8         874  ...      British Library HMNTS 11645.bb.42.
9        1143  ...  British Library HMNTS 11602.ee.10.(2.)

[10 rows x 10 columns]

In [49]:
new_book_df['Date of Publication'].str.isnumeric()

0       True
1       True
2       True
3       True
4       True
        ...
8282    True
8283    True
8284     NaN
8285    True
8286    True
Name: Date of Publication, Length: 8287, dtype: object

In [54]:
import pandas as pd
import numpy as np
property_df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')
property_df.head(10)
property_df.shape
property_df.head(20)

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [55]:
property_df['ST_NUM']
#property_df['ST_NUM'].isnull()
#property_df['ST_NUM'].isnull().count()

0    104.0
1    197.0
2      NaN
3    201.0
4    203.0
5    207.0
6      NaN
7    213.0
8    215.0
Name: ST_NUM, dtype: float64

In [56]:
property_df['ST_NUM'].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6     True
7    False
8    False
Name: ST_NUM, dtype: bool

In [57]:
property_df['ST_NUM'].isnull().count()

9

In [63]:
property_df['NUM_BATH']=pd.to_numeric(property_df['NUM_BATH'], errors='coerce')
property_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0   LEXINGTON            N            3       1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN       1.0   850
3  100004000.0   201.0    BERKELEY           12            1       NaN   700
4          NaN   203.0    BERKELEY            Y            3       2.0  1600
5  100006000.0   207.0    BERKELEY            Y          NaN       1.0   800
6  100007000.0     NaN  WASHINGTON          NaN            2       NaN   950
7  100008000.0   213.0     TREMONT            Y            1       1.0   NaN
8  100009000.0   215.0     TREMONT            Y           na       2.0  1800

In [ ]:
property_df['NUM_OCCUPIED']=pd.to_numeric(property_df['NUM_OCCUPIED'], errors='coerce')
property_df

In [65]:
new_prop_df=property_df.dropna()
new_prop_df

           PID  ST_NUM    ST_NAME OWN_OCCUPIED NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0   104.0     PUTNAM            Y            3       1.0  1000
1  100002000.0   197.0  LEXINGTON            N            3       1.5    --
8  100009000.0   215.0    TREMONT            Y           na       2.0  1800

In [68]:
property_na_fix_df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv')
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0   104.0      PUTNAM            Y            3        1  1000
1  100002000.0   197.0   LEXINGTON            N            3      1.5    --
2  100003000.0     NaN   LEXINGTON            N          NaN        1   850
3  100004000.0   201.0    BERKELEY           12            1      NaN   700
4          NaN   203.0    BERKELEY            Y            3        2  1600
5  100006000.0   207.0    BERKELEY            Y          NaN        1   800
6  100007000.0     NaN  WASHINGTON          NaN            2   HURLEY   950
7  100008000.0   213.0     TREMONT            Y            1        1   NaN
8  100009000.0   215.0     TREMONT            Y           na        2  1800

In [79]:
missing_values=['-','--','na','n/a','NA']
property_na_fix_df=pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/property.csv', na_values=missing_values)
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [80]:
property_na_fix_df.NUM_BEDROOMS.unique

<bound method Series.unique of 0    3.0
1    3.0
2    NaN
3    1.0
4    3.0
5    NaN
6    2.0
7    1.0
8    NaN
Name: NUM_BEDROOMS, dtype: float64>

In [81]:
property_na_fix_df['NUM_BEDROOMS'].is_unique

False

In [82]:
property_na_fix_df['NUM_BEDROOMS']=pd.to_numeric(property_na_fix_df['NUM_BEDROOMS'], errors='coerce')
property_na_fix_df

           PID  ST_NUM     ST_NAME OWN_OCCUPIED  NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0   104.0      PUTNAM            Y           3.0        1  1000.0
1  100002000.0   197.0   LEXINGTON            N           3.0      1.5     NaN
2  100003000.0     NaN   LEXINGTON            N           NaN        1   850.0
3  100004000.0   201.0    BERKELEY           12           1.0      NaN   700.0
4          NaN   203.0    BERKELEY            Y           3.0        2  1600.0
5  100006000.0   207.0    BERKELEY            Y           NaN        1   800.0
6  100007000.0     NaN  WASHINGTON          NaN           2.0   HURLEY   950.0
7  100008000.0   213.0     TREMONT            Y           1.0        1     NaN
8  100009000.0   215.0     TREMONT            Y           NaN        2  1800.0

In [88]:
property_na_fix_df['PROP_TYPE'] =np.where((property_na_fix_df['SQ_FT'].isna()==False),property_na_fix_df['SQ_FT'],'unknown')
property_na_fix_df

           PID  ST_NUM     ST_NAME  ... NUM_BATH   SQ_FT PROP_TYPE
0  100001000.0   104.0      PUTNAM  ...        1  1000.0    1000.0
1  100002000.0   197.0   LEXINGTON  ...      1.5     NaN   unknown
2  100003000.0     NaN   LEXINGTON  ...        1   850.0     850.0
3  100004000.0   201.0    BERKELEY  ...      NaN   700.0     700.0
4          NaN   203.0    BERKELEY  ...        2  1600.0    1600.0
5  100006000.0   207.0    BERKELEY  ...        1   800.0     800.0
6  100007000.0     NaN  WASHINGTON  ...   HURLEY   950.0     950.0
7  100008000.0   213.0     TREMONT  ...        1     NaN   unknown
8  100009000.0   215.0     TREMONT  ...        2  1800.0    1800.0

[9 rows x 8 columns]

In [91]:
new_prop_df
new_prop_df_BR=new_prop_df['NUM_BEDROOMS'].fillna(5,inplace=False)
new_prop_df_BR

0     3
1     3
8    na
Name: NUM_BEDROOMS, dtype: object